# Отчёт по расчётной работе по дисциплине ПиОИвИС 

Тема: Графы 
Цель: Определить, является ли вводимый граф – графом Бержа 
Задача: Создать алгоритм, который будет брать из файла данные и проверять по матрице смежности является ли этот граф графом Бержа 
Вариант: 1.19(мс) 
 
# Список ключевых понятий(определения): 

❖	Граф - это совокупность непустого множества вершин и множества пар вершин 
  
❖	Граф Бержа - граф, в котором хроматическое число любого порождённого подграфа равно размеру максимальной клики этого подграфа. Вершины графа Бержа имеют одинаковую степень. Граф является графом Бержа если ни он, ни его дополнение не имеет порождённых циклов нечётной длины (5 и более рёбер).
  
❖	Клика - подмножество вершин неориентированного графа, любые две из которых соединены ребром.
 
❖	Матрица смежности - один из способов представления графа в виде матрицы. Матрица NxN, где N – кол-во вершин графа. Если вершины связаны, то пересечению в матрице призначается 1, иначе 0 
  
# Файлы с содержанием матрицы смежности: 
 
graph1.txt 
 
graph2.txt 
 
graph3.txt 
  
graph4.txt 
 
graph5.txt 
 
# Алгоритм: 

1.	Выбрать файл с матрицей смежности и открыть его 
2.	Сосчитать количество элементов и строк в файле 
3.	Сравнить количество элементов с квадратом строк матрицы 
3.1.	Если числа не совпадают, то вывести, что это не является матрицей смежности и завершить программу 
3.2.	Если числа совпадают, перейти к пункту 4 
4.	Создать матрицу NxN, где N – кол-во строк и считать данные с файла в эту матрицу 
5.	Проверить правдиво ли то, что N=9 
6.	Проверить на правильность матрицы: чтобы степени вершин были равными  
7.	Проверить на то, чтобы каждая вершина имела ровно 4 связи 
8.	Вывести матрицу смежности 
9.	Вывести на экран является или нет этот граф графом Бержа 

# Вывод: 
В результате выполнения данной работы были получены следующие практические навыки: 

-изучены основы теории графов 
-изучены способы представления графов 
-изучены базовые алгоритмы для работы с графами 
 
