**Цель:**  
Разработать программу, способную формировать все возможные неориентированные множества без повторений из элементов исходного неориентированного множества. Количество элементов в каждом сформированном множестве должно быть равно исходному натуральному числу n.

**Задача:**
1. Разработать алгоритм генерации всех возможных неориентированных множеств из элементов исходного множества.
2. Убедиться, что каждое сформированное множество не содержит повторяющихся элементов.
3. Гарантировать, что количество элементов в каждом сформированном множестве соответствует исходному натуральному числу n.
4. Реализовать программу на выбранном языке программирования.
5. Проверить работоспособность программы на различных входных данных.

**Список понятий:**
1. Неориентированное множество - совокупность элементов, порядок которых не имеет значения.
2. Повторения - элементы, которые встречаются более одного раза в одном множестве.
3. Алгоритм - последовательность шагов для выполнения задачи.
4. Программа - набор инструкций, выполняющих определенную задачу на компьютере.
5. Входные данные - данные, которые поступают на вход программе для обработки.
6. Выходные данные - результат работы программы, полученный на основе входных данных.

**Алгоритм:**

1. Определить функцию `ReadFile`, которая открывает файл с именем "mnzh.txt" и считывает его содержимое в вектор строк `mnzh`.
2. Определить функцию `generatePermutations`, которая рекурсивно генерирует все перестановки элементов вектора `nums` и сохраняет их в векторе `result`.
3. В основной функции `main`:
    - Установить локаль для корректного отображения русского языка.
    - Вывести сообщение о максимальном количестве элементов в множестве и ждать нажатия клавиши для продолжения.
    - Считать множество из файла, используя функцию `ReadFile`.
    - Если размер множества не превышает 10 элементов:
        - Сформировать все возможные перестановки элементов множества с помощью функции `generatePermutations`.
        - Удалить обратные перестановки из результатов для избежания дублирования.
        - Вывести все полученные комбинации в консоль.
    - В противном случае вывести сообщение о том, что файл пуст или содержит более 10 элементов.

**Код:**
```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include<fstream>
#include <conio.h>
#include<utility>
#include<string>

using namespace std;

void ReadFile(vector<string>& mnzh) {
    ifstream file("mnzh.txt");
    if (file.is_open()) {
        string element;
        while (file >> element) {
            mnzh.push_back(element);
        }
        file.close();
    }
    else {
        cout << "Файл не был открыт\n";
        return;
    }
    for (auto& c : mnzh) {
        for (auto& d : c) {
            if (!isdigit(d))
                mnzh.clear();
        }
    }
}
void generatePermutations(vector<string>& nums, vector< vector<string>>& result, int start) {
    if (start == nums.size() - 1) {
        result.push_back(nums);
        return;
    }

    for (int i = start; i < nums.size(); ++i) {
        std::swap(nums[start], nums[i]);
        generatePermutations(nums, result, start + 1);
        std::swap(nums[start], nums[i]);
    }
}

int main() {
    setlocale(LC_ALL, "ru");
    vector<string>mnzh;
    cout << "Множество должно иметь не больше 10 элементов,элементы множества должны быть числами , элементы множества должны быть разделены пробелами \n";
    cout << "\nнажмите любую клавишу, чтобы продолжить  : ";
    while (!_kbhit()) {
    }
    _getch();
    system("cls");
    ReadFile(mnzh);
    if (mnzh.size() != 0 && mnzh.size() <= 10) {
        vector< vector<string>> result;
        cout << "Множества прогружаются , подождите ... ";
        generatePermutations(mnzh, result, 0);
        //удаление реверсивных множеств
        if (mnzh.size() != 1) {
            vector <vector<string>> tmp = result;
            for (auto& c : tmp) {
                reverse(c.begin(), c.end());
            }
            int count = 0;
            for (auto& c : result) {
                count = 0;
                for (auto& b : tmp) {
                    if (c == b) {
                        result.erase(result.begin() + count);
                        tmp.erase(tmp.begin() + count);
                        break;
                    }
                    count++;
                }
            }
        }
        system("cls");
        // Вывод всех комбинаций
        cout << "Всевозможные комбинации из исходного множества :\n\n";
        for (const auto& permutation : result) {
            cout << "{ ";
            for (auto& num : permutation) {
                cout << num << ",";
            }
            cout<<" }" << endl;
        }
        return 0;
    }
    else {
        cout << "Файл либо пустой либо в вашем множестве больше 10 элементов либо в множестве присутсвуют не только числа";
        return 0;
    }
}
```
**Вывод:**
После выполнения данного задания была разработана программа, способная формировать все возможные неориентированные множества без повторений из элементов исходного неориентированного множества. Эта программа обеспечивает гарантированное количество элементов в каждом сформированном множестве, соответствующее заданному натуральному числу n. Алгоритм был проверен на различных входных данных, подтверждая корректность его работы.
