#include <iostream>
#include "C:\Users\Максим\source\repos\RubicCube\RubicCube\RubicCubeGraphic.h"

/*!
\file
\brief Файл c описанием консольной графической составляющей класса RubicCube
в виде отдельного класса

Файл содержит в себе описание реализации методов класса RubicCube, необходимых
для реализации графической составляющей игры.
*/

using namespace std;

	 void RubicCubeGameVisuals::CubeChoiceMenuGraphic() {
		cout << "			     /]==============================]\\\n";
		cout << "			  -/?|                                |?\\-\n";
		cout << "			 <==+|     Выберите режим игры:       |+==>\n";
		cout << "			   \\\\|--------------------------------|//\n";
		cout << "			    ||                                ||\n";
		cout << "			    ||     1 - Случайный кубик.       ||\n";
		cout << "			    ||                                ||\n";
		cout << "			    ||       2 - Свой кубик.          ||\n";
		cout << "			    ||                                ||\n";
		cout << "			    \\\\================================//\n";
	}

	void RubicCubeGameVisuals::Banner() {
		cout << "			  $$$$$   $$  $$  $$$$$   $$$$$$   $$$$    $$$$      \n";
		cout << "			  $$  $$  $$  $$  $$  $$    $$    $$  $$  $$         \n";
		cout << "			  $$$$$   $$  $$  $$$$$     $$    $$       $$$$      \n";
		cout << "			  $$  $$  $$  $$  $$  $$    $$    $$  $$      $$     \n";
		cout << "			  $$  $$   $$$$   $$$$$   $$$$$$   $$$$    $$$$      \n";
		cout << "			                                                     \n";
		cout << "			   $$$$   $$  $$  $$$$$   $$$$$     $$$   $$$   $$$  \n";
		cout << "			  $$  $$  $$  $$  $$  $$  $$        $$$   $$$   $$$  \n";
		cout << "			  $$      $$  $$  $$$$$   $$$$      $$$   $$$   $$$  \n";
		cout << "			  $$  $$  $$  $$  $$  $$  $$                         \n";
		cout << "			   $$$$    $$$$   $$$$$   $$$$$     $$$   $$$   $$$  \n\n";
	}

	 void RubicCubeGameVisuals::MenuGraphic() {
		cout << "			  ,===============================================,\n";
		cout << "			 //                                               \\\\\n";
		cout << "			||                ВЫБЕРИТЕ ДЕЙСТВИЕ!               ||\n";
		cout << "			 \\\\                                               //\n";
		cout << "			_{|+=====------------------------------------=====+|}_\n";
		cout << "			[[/                                                \\]]\n";
		cout << "			+|+          1. Повернуть переднюю грань.          +|+\n";
		cout << "			[|]                                                [|]\n";
		cout << "			+|+          2. Повернуть левую грань.             +|+\n";
		cout << "			[-]                                                [-]\n";
		cout << "			||/          3. Повернуть правую грань.            \\||\n";
		cout << "			||                                                  ||\n";
		cout << "			||           4. Повернуть нижнюю грань.             ||\n";
		cout << "			||                                                  ||\n";
		cout << "			||           5. Повернуть верхнюю грань.            ||\n";
		cout << "			||\\                                                /||\n";
		cout << "			[-]          6. Повернуть заднюю грань.            [-]\n";
		cout << "			+|+                                                +|+\n";
		cout << "			[|]          7. Увидеть грани.                     [|]\n";
		cout << "			+|+                                                +|+\n";
		cout << "			[[\\          8. Выход.                             /]]\n";
		cout << "			[[\\                                                /]]\n";
		cout << "			\\=||     9. Проверить правильность раскраски.     ||=/\n";
		cout << "			\\=||                                              ||=/\n";
		cout << "			 \\=\\\\===========================================//=/\n";
	}
